realDavy/BLEHomeKit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_NO_STUB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Bluetooth LE (NimBLE) for HAP-BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=8
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_HOST_ALLOW_CONNECT_WITH_SCAN=y
CONFIG_BT_NIMBLE_HOST_QUEUE_CONG_CHECK=y
CONFIG_BT_NIMBLE_ENC_ADV_DATA=y
# CONFIG_BT_NIMBLE_OPTIMIZE_MULTI_CONN is not set
# HAP pairs over GATT; disable OS SMP so iPhone Home does not drop the link
# CONFIG_BT_NIMBLE_SM_LEGACY is not set
# CONFIG_BT_NIMBLE_SM_SC is not set
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=185

# Crypto used by HAP pairing
CONFIG_MBEDTLS_HKDF_C=y

# LVGL: only the widgets/fonts the light UI uses
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_ARC=y

# BSP default is 240x100 * 2 bytes * double-buffer ≈ 96 KB. That leaves
# too little heap for NimBLE + HAP GATT registration, which then abort()s
# (reboot loop = screen flicker, no HomeKit BLE advertisement).
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=20
# CONFIG_BSP_LCD_DRAW_BUF_DOUBLE is not set
# CONFIG_BSP_ERROR_CHECK is not set

CONFIG_PAL_BLE_ENABLED=y
# CONFIG_PAL_NETWORK_ENABLED is not set

# Save RAM: this accessory is BLE-only
# CONFIG_LWIP_IPV6 is not set
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
